{
    "Timestamp": "Time",
    "FillPrice": "Price",
    "FillTime": "Time",
    "Filled At": "Time",
    "Fill Amount": "Filled",
    "Order Price": "Price",
    "CreatedAt": "Time",
    "NoOpenOrders": "No orders.",
    "NoHistoryOrders": "No orders",
    "All Tokens": "All Assets",
    "Order Total": "Total",
    "NoBalance": "No balance in your account.",
    "NoDeposits": "No deposits in your account.",
    "NoWithdrawals": "No withdrawals in your account.",
    "TimingWhy": "We need 30 confirmations for your Ethereum transactions before we start generating the Zero-Knowledge proof to process your requests.",
    "FeeWhy": "The Loopring protocol requires us to process every user request, including account registration, password-reset, deposits, and withdrawals. We charge fees to cover Zero-Knowledge proof cost and Ethereum transaction gas fee, and also to avoid Sybil attack.",
    "DepositInstruction_1": "Deposit assets to your exchange account to start trading. Please note that Loopring is a non-custodial exchange protocol, which means only you have access to your exchange account. You can request withdrawals anytime.",
    "DepositInstruction_Timing": "Deposits usually take 5 to 30 minutes. In some situations, they may take a couple of hours. Please be patient.",
    "DepositInstruction_Fee": "We charge 0.0001 ETH for each deposit.",
    "DepositInstruction_KeepEther": "Please keep some Ether in your wallet for withdrawals.",
    "DepositInstruction_KeepEtherWhy": "We suggest you keep some small amount of Ether in your wallet to pay future withdrawal fees (0.002 ETH per withdrawal) and transaction gas. This suggestion will become invalid once we support off-chain withdrawals.",
    "DepositInstructionNotification": "Your deposit request has been submitted to Ethereum. Please monitor your transaction, as you will not see the corresponding deposit record on Loopring Exchange before it is confirmed on-chain.",
    "DepositInstructionNotificationFailed": "Your deposit request failed. Please try again!",
    "WithdrawInstruction_1": "The Loopring protocol assures all withdrawal requests must be processed unconditionally in the order they are received.",
    "WithdrawInstruction_Timing": "Withdrawals usually take 5 to 30 minutes. In some situations, they may take a couple of hours. Please be patient.",
    "WithdrawInstruction_Fee": "We charge 0.002 ETH for each withdrawal.",
    "WithdrawInstructionNotification": "Your withdrawal request has been submitted to Ethereum. Please monitor your transaction, as you will not see the corresponding withdrawal record on Loopring Exchange before it is confirmed on-chain.",
    "WithdrawInstructionNotificationFailed": "Your withdrawal request failed. Please try again!",
    "LogoutInstruct_1": "Logging out of the Loopring Exchange will clear your trading password from this browser. You can log in again using the same password. You can always reset your password with an Ethereum transaction, which means forgetting your trading password will not make you lose any funds on Loopring.",
    "LogoutInstruct_2": "Are you sure you want to log out?",
    "AccountBeingRegisteredInstruct_1": "Your account is being created. We will wait for at least one confirmation for your Ethereum transaction. Please be patient.",
    "PromptForPassword": "Please enter your password to continue.",
    "RegisterAccountInstruction_1": "You need an exchange account before trading. This simply ties your Ethereum address to the exchange Merkle tree. You can make deposits once your account registration request is being processed. Withdrawals and trading will be available after your account has been registered.",
    "RegisterAccountInstruction_Timing": "Account registration usually takes 5 to 30 minutes. In some situations, it may take a couple of hours. Please be patient.",
    "RegisterAccountInstruction_Fee": "We charge 0.0036 ETH for account registration.",
    "RegisterAccountInstruction_FeeWhy": "The current version of the Loopring protocol can only support up to 1 million users for each exchange (to reduce Zero-Knowledge proof cost). We charge account registration fees to cover relayer cost and Ethereum transaction gas, and also to avoid Sybil attack.",
    "ResetPasswordInstruction_1": "Using a different password will automatically cancel all your existing orders. Before your password is reset, you will not be able to trade, or submit any withdrawal requests.",
    "ResetPasswordInstruction_Timing": "Resetting password usually takes 5 to 30 minutes. In some situations, it may take a couple of hours. Please be patient.",
    "ResetPasswordInstruction_Fee": "We charge 0.0002 ETH for resetting password.",
    "PasswordRequirements": "Your password must:",
    "PasswordRequirementsTip": "Loopring uses your password to generate your trading key pair, and the public key is stored on-chain. A simple password makes it easy for hackers to guess your password by brute force. If you are insensitive to asset security, why not trade on centralized exchanges?",
    "PasswordRequirements_1": "contain at least one lowercase letter.",
    "PasswordRequirements_2": "contain at least one uppercase letter.",
    "PasswordRequirements_3": "contain at least one numerical digit (e.g. 0, 1, 2, 3).",
    "PasswordRequirements_4": "contain at least one special character (e.g. $, #, @).",
    "PasswordRequirements_5": "be between 12 and 128 characters.",
    "PasswordMismatch": "Password doesn't match!",
    "PasswordTooSimple": "Your password is too simple!",
    "PasswordResetting": "Your password is resetting",
    "WelcomeBack": "Welcome back to Loopring Exchange!",
    "InvalidPassword": "Your password is invalid!",
    "UnsupportedNetworkWarning": "You are on a wrong network! Please switch to ",
    "EthereumMainNet": "Ethereum mainnet.",
    "EthereumRinkebyTestnet": "Ethereum's Rinkeby mainnet.",
    "EthereumGörliTestNet": "Ethereum's Görli mainnet.",
    "IsNotAValidMarket": " is not a valid market or is not supported yet!",
    "AccountBeingRegisteredNotification": "Your account is being registered. Usually it takes 5 to 30 minutes; but in some situations, it may take a couple of hours. You can make deposits while waiting.",
    "AccountRegistrationFailedNotofication": "Something went wrong. Please try to register again!",
    "PasswordResetNotification": "Your password is being reset. Usually it takes 5 to 30 minutes; but in some situations, it may take a couple of hours. You can make deposits while waiting.",
    "PasswordResetFailedNotofication": "Something went wrong. Please try to register again!",
    "Web3 Unavailable": "MetaMask Unavailable",
    "Web3UnavailableTip": "You need MetaMask installed before using Loopring Exchange!",
    "ConnectToWeb3Tip": "Connect to your Ethereum account to start using Loopring Exchange.",
    "MetaMaskNotDetected": "MetaMask is not detected. You must have MetaMask to use Loopring Exchange!",
    "NoAccountTooltip": "You don't have a Loopring Exchange account yet, please click the button below to register.",
    "NeedLoginTooltip": "You need to log into the system to start trading.",
    "YouHaveLoggedInTooltip": "You have logged in. Enjoy our non-custodial & high-performance trading experience!",
    "exportAccountWarning": "Please keep the following information private; otherwise, you may lose your assets on the exchange.",
    "Maximum_price_input_decimal_part_1": "The number of price decimal points can't be larger than ",
    "Maximum_amount_input_decimal_part_1": "The number of amount decimal points can't be larger than ",
    "Maximum_input_decimal_part_2": "",
    "Minimum_order_size": "Minimum order size:",
    "Maximum_order_size": "Maximum order size:",
    "MobileNotSupportedNotice": "Loopring Exchange doesn't support mobile devices yet. We apologize for any inconvenience.",
    "MobileAppNotice": "We will launch a smart-wallet mobile app with a built-in Loopring Exchange soon.",
    "CookieConsentMessage": "By using our site you agree to accept our ",
    "404title": "Hmm, the page is lost in the loop...",
    "metaMaskPendingTxTip": "Pay attention to the pending transactions in MetaMask. Sometimes MetaMask doesn't pop up dialogs for you, so you have to click on your browser's MetaMask button to check these transactions.",
    "metamaskConfirm": "Please approve transactions using MetaMask",
    "walletConnectPendingTxTip": "Please open your WalletConnect-compatible wallet, and pay attention to new pending transactions.",
    "walletConnectConfirm": "Please approve the transactions using your WalletConnect-compatible wallet.",
    "depositTipApproveZero": "Please approve the 1st transaction to cancel Loopring's current allowance (too small).",
    "depositTipApprove1": "Please approve the 1st transaction to approve Loopring's allowance.",
    "depositTipApprove3_2": "Please approve a 2nd transaction to approve Loopring's new allowance.",
    "depositTipDeposit2": "Please approve a 2nd transaction to deposit tokens. (You can ignore MetaMask's warning, your transaction will succeed.)",
    "depositTipDeposit3": "Please approve a 3rd transaction to deposit tokens. (You can ignore MetaMask's warning, your transaction will succeed.)",
    "YourEthereumAddressIs": "You are using this address: ",
    "MenuSupportGroup": "Support",
    "MenuMyEthAccount": "My Address",
    "MenuMyDexAccount": "My Account",
    "MaintenanceModalTitle": "Our system is under maintenance.",
    "MaintenanceModalInstruction": "We are sorry for any inconvenience.",
    "StatusConfirming": "We need at least 30 confirmations for your request on Ethereum.",
    "StatusProcessing": "We may be waiting for more requests from other users for cost-efficient batch processing (up to 12 hours); we may be generating a Zero-Knowledge proof for your requests as well.",
    "StatusProcessing2": "No worries, we'll process all requests in the order they are received; otherwise, our LRC staking will be slashed by the Loopring protocol.",
    "NoChineseDocument": "",
    "HonorVip": "Loopring Lifetime Honor VIP",
    "Status / Operations": "Status",
    "whyDexPassword": "Why do I need an Exchange password? The Loopring protocol requires all off-chain requests to be signed using EdDSA instead of Ethereum's ECDSA algorithm for the sake of zkRollup efficiency. Your password will be used to generate your EdDSA keypair on the client-side.",
    "BuyPriceHigher": "Your buy price is 20% higher than the last price.",
    "SellPriceLower": "Your sell price is 20% lower than the last price.",
    "AutomaticTheme": "Switch automatically based on my time",
    "CancelAllConfirm": "Are you sure to cancel all open orders?"
}